#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
module.iam.aws_iam_role.lambda_scraper_service: Refreshing state... [id=lambda-scraper-service-dev]
module.iam.aws_iam_role.lambda_email_service: Refreshing state... [id=lambda-email-service-dev]
module.lambda_scraper.aws_cloudwatch_log_group.function: Refreshing state... [id=/aws/lambda/kpz-scraper-dev]
module.iam.aws_iam_role.lambda_backend_api: Refreshing state... [id=lambda-backend-api-dev]
module.iam.aws_iam_openid_connect_provider.github_actions: Refreshing state... [id=arn:aws:iam::441104482452:oidc-provider/token.actions.githubusercontent.com]
module.eventbridge_scraper.aws_iam_role.eventbridge_scheduler: Refreshing state... [id=kpz-dev-scraper-daily-scheduler-role]
module.lambda_backend_api.aws_cloudwatch_log_group.function: Refreshing state... [id=/aws/lambda/kpz-backend-api-dev]
module.s3_frontend.aws_s3_bucket.frontend: Refreshing state... [id=kpz-frontend-dev]
module.api_gateway.aws_apigatewayv2_api.backend: Refreshing state... [id=q53a8x2xfl]
module.iam.aws_iam_role.lambda_notification_service: Refreshing state... [id=lambda-notification-service-dev]
module.s3_lambda_artifacts.aws_s3_bucket.lambda_artifacts: Refreshing state... [id=kpz-lambda-artifacts-dev]
module.iam.aws_iam_role.github_actions: Refreshing state... [id=github-actions-lambda-deploy-dev]
module.iam.aws_iam_role_policy_attachment.lambda_scraper_service_basic: Refreshing state... [id=lambda-scraper-service-dev-20260103090212287700000001]
module.iam.aws_iam_role_policy_attachment.lambda_backend_api_basic: Refreshing state... [id=lambda-backend-api-dev-20251231095602265300000001]
module.iam.aws_iam_role_policy.lambda_email_service_ses: Refreshing state... [id=lambda-email-service-dev:ses-send-email-policy]
module.iam.aws_iam_role_policy_attachment.lambda_email_service_basic: Refreshing state... [id=lambda-email-service-dev-20251231095602381300000002]
module.lambda_scraper.aws_lambda_function.function: Refreshing state... [id=kpz-scraper-dev]
module.lambda_backend_api.aws_lambda_function.function: Refreshing state... [id=kpz-backend-api-dev]
module.iam.aws_iam_role_policy_attachment.lambda_notification_service_basic: Refreshing state... [id=lambda-notification-service-dev-20251231095602401100000003]
module.iam.aws_iam_role_policy.lambda_notification_service_sns: Refreshing state... [id=lambda-notification-service-dev:sns-publish-policy]
module.iam.aws_iam_role_policy.github_actions_terraform: Refreshing state... [id=github-actions-lambda-deploy-dev:terraform-state-policy]
module.iam.aws_iam_role_policy.github_actions_lambda: Refreshing state... [id=github-actions-lambda-deploy-dev:lambda-deployment-policy]
module.iam.aws_iam_role_policy.github_actions_frontend: Refreshing state... [id=github-actions-lambda-deploy-dev:frontend-deployment-policy]
module.iam.aws_iam_role_policy.github_actions_terraform_infra: Refreshing state... [id=github-actions-lambda-deploy-dev:terraform-infrastructure-policy]
module.api_gateway.aws_apigatewayv2_stage.default: Refreshing state... [id=$default]
module.eventbridge_scraper.aws_iam_role_policy.eventbridge_scheduler_lambda: Refreshing state... [id=kpz-dev-scraper-daily-scheduler-role:lambda-invoke-policy]
module.api_gateway.aws_lambda_permission.api_gateway: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.api_gateway.aws_apigatewayv2_integration.lambda: Refreshing state... [id=rg7qvrd]
module.eventbridge_scraper.aws_scheduler_schedule.lambda_trigger: Refreshing state... [id=default/kpz-dev-scraper-daily]
module.api_gateway.aws_apigatewayv2_route.default: Refreshing state... [id=owvppu3]
module.eventbridge_scraper.aws_lambda_permission.eventbridge_scheduler: Refreshing state... [id=AllowExecutionFromEventBridgeScheduler]
module.s3_frontend.aws_s3_bucket_public_access_block.frontend: Refreshing state... [id=kpz-frontend-dev]
module.s3_frontend.aws_s3_bucket_website_configuration.frontend: Refreshing state... [id=kpz-frontend-dev]
module.s3_lambda_artifacts.aws_s3_bucket_versioning.lambda_artifacts: Refreshing state... [id=kpz-lambda-artifacts-dev]
module.s3_lambda_artifacts.aws_s3_bucket_public_access_block.lambda_artifacts: Refreshing state... [id=kpz-lambda-artifacts-dev]
module.s3_lambda_artifacts.aws_s3_bucket_server_side_encryption_configuration.lambda_artifacts: Refreshing state... [id=kpz-lambda-artifacts-dev]
module.s3_lambda_artifacts.aws_s3_bucket_lifecycle_configuration.lambda_artifacts: Refreshing state... [id=kpz-lambda-artifacts-dev]
module.s3_frontend.aws_s3_bucket_policy.frontend: Refreshing state... [id=kpz-frontend-dev]
module.cloudfront.aws_cloudfront_distribution.frontend: Refreshing state... [id=E2VPVOEHAHR6WE]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.acm_certificate.aws_acm_certificate.cloudfront will be created
  + resource "aws_acm_certificate" "cloudfront" {
      + arn                       = (known after apply)
      + domain_name               = "kitaplatz-zentrale.de"
      + domain_validation_options = [
          + {
              + domain_name           = "kitaplatz-zentrale.de"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "www.kitaplatz-zentrale.de"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "kitaplatz-zentrale.de",
          + "www.kitaplatz-zentrale.de",
        ]
      + tags                      = {
          + "Domain"      = "kitaplatz-zentrale.de"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "kpz-dev-cloudfront-cert"
        }
      + tags_all                  = {
          + "Domain"      = "kitaplatz-zentrale.de"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "kpz-dev-cloudfront-cert"
          + "Project"     = "KPZ"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"

      + options (known after apply)
    }

  # module.cloudfront.aws_cloudfront_distribution.frontend will be updated in-place
  ~ resource "aws_cloudfront_distribution" "frontend" {
      ~ aliases                         = [
          + "kitaplatz-zentrale.de",
          + "www.kitaplatz-zentrale.de",
        ]
        id                              = "E2VPVOEHAHR6WE"
        tags                            = {
            "Environment" = "dev"
            "ManagedBy"   = "terraform"
            "Name"        = "kpz-frontend-cdn-dev"
        }
        # (22 unchanged attributes hidden)

      ~ viewer_certificate {
          + acm_certificate_arn            = (known after apply)
          ~ cloudfront_default_certificate = true -> false
          ~ minimum_protocol_version       = "TLSv1" -> "TLSv1.2_2021"
          + ssl_support_method             = "sni-only"
            # (1 unchanged attribute hidden)
        }

        # (4 unchanged blocks hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

Warning: Reference to undefined provider

  on main.tf line 143, in module "acm_certificate":
 143:     aws.us-east-1 = aws.us-east-1

There is no explicit declaration for local provider name "aws.us-east-1" in
module.acm_certificate, so Terraform is assuming you mean to pass a
configuration for "hashicorp/aws".

If you also control the child module, add a required_providers entry named
"aws.us-east-1" with the source address "hashicorp/aws".

Warning: Redundant ignore_changes element

  on ../../modules/compute/lambda/main.tf line 5, in resource "aws_lambda_function" "function":
   5: resource "aws_lambda_function" "function" {

Adding an attribute name to ignore_changes tells Terraform to ignore future
changes to the argument in configuration after the object has been created,
retaining the value originally configured.

The attribute last_modified is decided by the provider alone and therefore
there can be no configured value to compare with. Including this attribute in
ignore_changes has no effect. Remove the attribute from ignore_changes to
quiet this warning.

(and one more similar warning elsewhere)

Warning: Invalid Attribute Combination

  with module.s3_lambda_artifacts.aws_s3_bucket_lifecycle_configuration.lambda_artifacts,
  on ../../modules/storage/lambda-artifacts/main.tf line 46, in resource "aws_s3_bucket_lifecycle_configuration" "lambda_artifacts":
  46: resource "aws_s3_bucket_lifecycle_configuration" "lambda_artifacts" {

No attribute specified when one (and only one) of
[rule[0].filter,rule[0].prefix] is required

This will be an error in a future version of the provider

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @5h3rr1ll, Action: `pull_request`, Workflow: `Terraform Deploy (Dev)`*